; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph2 - mode
	image5 - mode
	infrared3 - mode
	thermograph1 - mode
	image8 - mode
	infrared6 - mode
	image4 - mode
	image7 - mode
	infrared0 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared6)
	(supports instrument0 image5)
	(supports instrument0 infrared3)
	(supports instrument0 infrared0)
	(supports instrument0 image8)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image7)
	(supports instrument1 infrared3)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
)
(:goal (and
	(have_image Phenomenon5 image7)
	(have_image Phenomenon5 infrared0)
	(have_image Planet6 infrared3)
	(have_image Planet6 image8)
	(have_image Star7 infrared6)
	(have_image Phenomenon8 infrared3)
	(have_image Planet9 image7)
	(have_image Planet9 image8)
	(have_image Planet9 image5)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon10 image4)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon11 infrared3)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 13
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 13
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 13
4. (turn_to satellite0 planet9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet9)
   goals met: 0 of 13
5. (take_image satellite0 planet9 instrument1 image7)
   added: (have_image planet9 image7)
   goals met: 1 of 13
6. (turn_to satellite0 phenomenon8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 13
7. (take_image satellite0 phenomenon8 instrument1 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 2 of 13
8. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 13
9. (take_image satellite0 phenomenon5 instrument1 image7)
   added: (have_image phenomenon5 image7)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 13
11. (take_image satellite0 phenomenon10 instrument1 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 4 of 13
12. (take_image satellite0 phenomenon10 instrument1 image4)
   added: (have_image phenomenon10 image4)
   goals met: 5 of 13
13. (turn_to satellite0 groundstation0 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation0)
   goals met: 5 of 13
14. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 13
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 13
16. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 5 of 13
17. (turn_to satellite0 phenomenon11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 13
18. (take_image satellite0 phenomenon11 instrument0 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 6 of 13
19. (take_image satellite0 phenomenon11 instrument0 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 7 of 13
20. (turn_to satellite0 phenomenon5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon5)
   goals met: 7 of 13
21. (take_image satellite0 phenomenon5 instrument0 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 8 of 13
22. (turn_to satellite0 planet6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet6)
   goals met: 8 of 13
23. (take_image satellite0 planet6 instrument0 image8)
   added: (have_image planet6 image8)
   goals met: 9 of 13
24. (take_image satellite0 planet6 instrument0 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 10 of 13
25. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 10 of 13
26. (take_image satellite0 planet9 instrument0 image5)
   added: (have_image planet9 image5)
   goals met: 11 of 13
27. (take_image satellite0 planet9 instrument0 image8)
   added: (have_image planet9 image8)
   goals met: 12 of 13
28. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 12 of 13
29. (take_image satellite0 star7 instrument0 infrared6)
   added: (have_image star7 infrared6)
   goals met: 13 of 13
